Tekla Open API Reference for Tekla Structures 2025
PointList.IndexOf Method
Overload List
Name | Description
IndexOf(Point)
 Gets the index of the specified point.
IndexOf(Point, Int32)
 Gets the index of the specified point between the index to start the search from and the end of the list.
IndexOf(Point, Int32, Int32)
 Gets the index of the specified point between the index to start the search from and startIndex + count.
Top
See Also
Reference
PointList Class
Tekla.Structures.Drawing Namespace